In [3]:
import pandas as pd
import numpy as np

## Ejercicio 1
Escribir un programa que pregunte al usuario por las ventas de un rango de años y muestre por pantalla una serie con los datos de las ventas indexada por los años, antes y después de aplicarles un descuento del 10%.

In [ ]:
inicio = 1995
fin = 2023
ventas = {} #Se guardan los datos en un diccionario y se pasa a pandas
cantidad = 0
for año in range(inicio, fin+1):
    cantidad += (100+10)
    descuento = (cantidad-cantidad*0.10)
    ventas[año] = descuento
tabla = pd.Series(ventas) #pasamos a serie
df = pd.DataFrame(tabla) #pasamos a datafranme
df.tail(10)

           0
2014  1980.0
2015  2079.0
2016  2178.0
2017  2277.0
2018  2376.0
2019  2475.0
2020  2574.0
2021  2673.0
2022  2772.0
2023  2871.0

## Ejercicio 2
Escribir una función que reciba un diccionario con las notas de los alumno de un curso y devuelva una serie con la nota mínima, la máxima, media y la desviación típica.

In [ ]:
def notas(alumnos: dict):
    tabla = pd.DataFrame.from_dict(alumnos, orient='index')
    minima = tabla.min()
    maxima = tabla.max()
    media = tabla.mean()
    desviacion = tabla.std()
    serie = pd.concat([minima, maxima, media, desviacion], axis=1)
    serie.columns = ['Min', 'Max', 'Mean', 'Std']
    return serie.squeeze() #lo convierte en una serie

In [ ]:
notas_alumnos = {'pepe': 6, 'ana': 8, 'rodolfo': 3, 'javi': 10, 'andres': 7}

In [ ]:
notas(notas_alumnos)

Min      3.000000
Max     10.000000
Mean     6.800000
Std      2.588436
Name: 0, dtype: float64

## Ejercicio 3
Escribir una función que reciba un diccionario con las notas de los alumnos de un curso y devuelva una serie con las notas de los alumnos aprobados ordenadas de mayor a menor.

In [ ]:
def notasAprobadasOrdenadas(alumnos: dict):
    tabla = pd.DataFrame.from_dict(alumnos, orient='index', columns = ['Notas'])
    #tabla['Alumnos'] = tabla.index
    #tabla = tabla[['Alumnos', 'Notas']] 
    #tabla.index = range(1, len(tabla) + 1)  # Establecer índice numérico
    return tabla[tabla['Notas']>=5].sort_values(by='Notas', ascending=False).squeeze()

In [ ]:
notasAprobadasOrdenadas(notas_alumnos)

javi      10
ana        8
andres     7
pepe       6
Name: Notas, dtype: int64

## Ejercicio 4
Escribir programa que genere y muestre por pantalla un DataFrame con los datos de la tabla siguiente:

In [ ]:
meses = []
ventas = []
gastos = []

for dato in range(4):
    mes = input('Introduce el mes: ')
    venta = int(input('Introduce la venta: '))
    gasto = int(input('Introduce el gasto: '))
    meses.append(mes)
    ventas.append(venta)
    gastos.append(gasto)

In [ ]:
meses

['enero', 'febrero', 'marzo', 'abril']

In [ ]:
ventas

[30500, 35600, 28300, 33900]

In [ ]:
gastos

[22000, 23400, 18100, 20700]

In [ ]:
resultados = pd.DataFrame(data={'Mes': meses, 'Ventas': ventas, 'Gastos': gastos})
resultados

       Mes  Ventas  Gastos
0    enero   30500   22000
1  febrero   35600   23400
2    marzo   28300   18100
3    abril   33900   20700

## Ejercicio 5
Escribir una función que reciba un DataFrame con el formato del ejercicio anterior, una lista de meses, y devuelva el balance (ventas - gastos) total en los meses indicados.

In [ ]:
def balance(resultados, meses):
    resultados['Balance'] = resultados['Ventas'] - resultados['Gastos']
    return resultados[resultados['Mes'].isin(meses)]['Balance'].sum() # Usamos isin para comprobar campos en listas

In [ ]:
balance(resultados, ['enero', 'febrero'])

20700

## Ejercicio 6
El fichero cotizacion.csv contiene las cotizaciones de las empresas del IBEX35 con las siguientes columnas: 
- nombre (nombre de la empresa), 
- Final (precio de la acción al cierre de bolsa), 
- Máximo (precio máximo de la acción durante la jornada), 
- Mínimo (precio mínimo de la acción durante la jornada), 
- volumen (Volumen al cierre de bolsa), 
- Efectivo (capitalización al cierre en miles de euros). 

Construir una función que construya un DataFrame a partir del fichero con el formato anterior y devuelva otro DataFrame con el mínimo, el máximo y la media de dada columna.

In [74]:
cotizaciones = pd.read_csv('cotizacion.csv', sep=';', decimal=',', thousands='.', index_col=0) # Se puede establecer los decimales y miles al leer los csv
cotizaciones

                   Final      Máximo      Mínimo   Volumen   Efectivo
Nombre
ACCIONA          95.9500     96.7500     94.4000     84962    8166.11
ACERINOX       8668.0000   8672.0000   8468.0000     88599    7633.81
ACS              37.2800     37.6600     37.2200    655982   24517.29
AENA            167.1000    167.5000    166.1000    133738   22336.10
AMADEUS          69.9600     70.6400     69.5600    640476   44795.47
ARCELORMIT.   14152.0000  14318.0000     14.0800    702841    9989.65
BA.SABADELL       1.0165   1033.0000      1.0165  12358512   12637.65
BA.SANTANDER      4.0200      4.0675      4.0100  36129692  145765.44
BANKIA         2249.0000   2262.0000   2224.0000   3024454    6803.54
BANKINTER         6.5600   6604.0000   6522.0000   1375976    9030.20
BBVA           5024.0000      5.0500   4969.0000  26447612  132560.15
CAIXABANK      2763.0000   2806.0000   2762.0000  13031097   36239.22
CELLNEX          30.1700     30.7000     30.1700    857237   25965.29
CIE AUTOMOT.     23.4400     23.7400     23.4000     99506    2343.09
ENAGAS           25.6000     25.6600     25.0700     84254   21524.77
ENCE           3882.0000   3974.0000   3846.0000   2099698    8219.83
ENDESA           22.9500     23.0300     22.6200   1236799   28233.46
FERROVIAL        21.6100     21.7200     21.3800   2065931   44656.05
GRIFOLS CL.A     23.3000     23.6000     23.2700    719503   16787.55
IAG               5.3000      5.4600   5292.0000   2155081   11561.95
IBERDROLA         8.4500      8.4500   8262.0000  15637958  131426.05
INDITEX          24.9300     25.1900     24.8700   2600144   65012.92
INDRA A           9.5600   9685.0000   9535.0000     39206    3755.57
INM.COLONIAL   9915.0000   9915.0000   9745.0000    671753    6640.38
MAPFRE         2654.0000   2654.0000      2.6200   3045972    8063.13
MEDIASET       6446.0000   6592.0000   6446.0000   2647557   17277.04
MELIA HOTELS      8.1400      8.1900      8.0200     48021    3914.93
MERLIN           12.0800     12.0800     11.8300    777543    9357.77
NATURGY          26.7000     26.7700     26.5300   2100737   55986.54
R.E.C.        19705.0000  19875.0000  19675.0000   1246171   24585.33
REPSOL        14515.0000  14605.0000     14.4600   5046648   73333.78
SIEMENS GAME     14.3300     14.3900  14155.0000   1054847   15084.56
TEC.REUNIDAS     23.0000     23.2000     22.7800      1221    2807.19
TELEFONICA     7204.0000   7256.0000   7185.0000   9913249   71564.99
VISCOFAN         48.4600     49.1200     48.4600      6771    3295.43

In [75]:
cotizaciones.info()

<class 'pandas.core.frame.DataFrame'>
Index: 35 entries, ACCIONA to VISCOFAN
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Final     35 non-null     float64
 1   Máximo    35 non-null     float64
 2   Mínimo    35 non-null     float64
 3   Volumen   35 non-null     int64
 4   Efectivo  35 non-null     float64
dtypes: float64(4), int64(1)
memory usage: 1.6+ KB

In [76]:
# Reemplazar comas por puntos en las columnas y convertirlas manualmente a float

#cotizaciones['Final'] = cotizaciones['Final'].str.replace(',', '.').str.replace('.', '')
#cotizaciones['Máximo'] = cotizaciones['Máximo'].str.replace(',', '.').str.replace('.', '')
#cotizaciones['Mínimo'] = cotizaciones['Mínimo'].str.replace(',', '.').str.replace('.', '')
#cotizaciones['Volumen'] = cotizaciones['Volumen'].str.replace(',', '.').str.replace('.', '')
#cotizaciones['Efectivo'] = cotizaciones['Efectivo'].str.replace(',', '.').str.replace('.', '')
#columnas_a_convertir = ['Final', 'Máximo', 'Mínimo', 'Volumen', 'Efectivo']
#cotizaciones[columnas_a_convertir] = cotizaciones[columnas_a_convertir].astype(float)

In [77]:
cotizaciones.describe()

              Final        Máximo        Mínimo       Volumen       Efectivo
count     35.000000     35.000000     35.000000  3.500000e+01      35.000000
mean    2796.768757   3170.113357   3136.510471  4.252279e+06   31767.778000
std     5007.267143   5160.834249   4804.485259  7.901060e+06   38100.607064
min        1.016500      4.067500      1.016500  1.221000e+03    2343.090000
25%       17.970000     23.115000     22.700000  3.871070e+05    8114.620000
50%       30.170000     49.120000     48.460000  1.236799e+06   16787.550000
75%     3322.500000   5283.000000   5869.000000  2.836006e+06   40447.635000
max    19705.000000  19875.000000  19675.000000  3.612969e+07  145765.440000

## Ejercicio 7
El fichero titanic.csv contiene información sobre los pasajeros del Titanic. Escribir un programa con los siguientes requisitos:

1. Generar un DataFrame con los datos del fichero.

2. Mostrar por pantalla las dimensiones del DataFrame, el número de datos que contiene, los nombres de sus columnas y filas, los tipos de datos de las columnas, las 10 primeras filas y las 10 últimas filas.

3. Mostrar por pantalla los datos del pasajero con identificador 148.
4. Mostrar por pantalla las filas pares del DataFrame.
5. Mostrar por pantalla los nombres de las personas que iban en primera clase ordenadas alfabéticamente.
6. Mostrar por pantalla el porcentaje de personas que sobrevivieron y murieron.
7. Mostrar por pantalla el porcentaje de personas que sobrevivieron en cada clase.
8. Eliminar del DataFrame los pasajeros con edad desconocida.
9. Mostrar por pantalla la edad media de las mujeres que viajaban en cada clase.
10. Añadir una nueva columna booleana para ver si el pasajero era menor de edad o no.
11. Mostrar por pantalla el porcentaje de menores y mayores de edad que sobrevivieron en cada clase.


1. Generar un DataFrame con los datos del fichero.

In [95]:
titanic = pd.read_csv('titanic.csv')

2. Mostrar por pantalla las dimensiones del DataFrame, el número de datos que contiene, los nombres de sus columnas y filas, los tipos de datos de las columnas, las 10 primeras filas y las 10 últimas filas.

In [96]:
titanic.shape

(891, 12)

In [97]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [98]:
titanic.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [99]:
titanic.tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

3. Mostrar por pantalla los datos del pasajero con identificador 148.

In [100]:
titanic.loc[147]

PassengerId                                 148
Survived                                      0
Pclass                                        3
Name           Ford, Miss. Robina Maggie "Ruby"
Sex                                      female
Age                                         9.0
SibSp                                         2
Parch                                         2
Ticket                               W./C. 6608
Fare                                     34.375
Cabin                                       NaN
Embarked                                      S
Name: 147, dtype: object

4. Mostrar por pantalla las filas pares del DataFrame.

In [101]:
# Filtrar las filas con índices pares
filas_pares = titanic.iloc[::2] # de dos en dos
filas_pares

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

5. Mostrar por pantalla los nombres de las personas que iban en primera clase ordenadas alfabéticamente.

In [102]:
primera_clase = titanic[titanic['Pclass']==1].sort_values(by='Name')
primera_clase

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
730,731,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
305,306,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
297,298,0,1,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
498,499,0,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S
460,461,1,1,"Anderson, Mr. Harry",male,48.00,0,0,19952,26.5500,E12,S
...,...,...,...,...,...,...,...,...,...,...,...,...
155,156,0,1,"Williams, Mr. Charles Duane",male,51.00,0,1,PC 17597,61.3792,NaN,C
351,352,0,1,"Williams-Lambert, Mr. Fletcher Fellows",male,NaN,0,0,113510,35.0000,C128,S
55,56,1,1,"Woolner, Mr. Hugh",male,NaN,0,0,19947,35.5000,C52,S
555,556,0,1,"Wright, Mr. George",male,62.00,0,0,113807,26.5500,NaN,S
325,326,1,1,"Young, Miss. Marie Grice",female,36.00,0,0,PC 17760,135.6333,C32,C

6. Mostrar por pantalla el porcentaje de personas que sobrevivieron y murieron.

In [103]:
supervivientes = titanic['Survived'].sum()
porcentaje_supervivientes = supervivientes/len(titanic)
porcentaje_supervivientes

0.3838383838383838

7. Mostrar por pantalla el porcentaje de personas que sobrevivieron en cada clase.

In [104]:
supervivientes_clase = pd.pivot_table(titanic, values='Survived', index=['Pclass'], aggfunc='sum')

In [105]:
clase1 = len(titanic[titanic['Pclass']==1])
clase2 = len(titanic[titanic['Pclass']==2])
clase3 = len(titanic[titanic['Pclass']==3])

clase1, clase2, clase3

(216, 184, 491)

In [106]:
supervivientes_clase['Total'] = [clase1, clase2, clase3]
supervivientes_clase['Porcentaje'] = round((supervivientes_clase['Survived']/supervivientes_clase['Total'])*100, 2)
supervivientes_clase

        Survived  Total  Porcentaje
Pclass
1            136    216       62.96
2             87    184       47.28
3            119    491       24.24

8. Eliminar del DataFrame los pasajeros con edad desconocida.

In [107]:
titanic2 = titanic['Age'].dropna()
titanic2

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
885    39.0
886    27.0
887    19.0
889    26.0
890    32.0
Name: Age, Length: 714, dtype: float64

9. Mostrar por pantalla la edad media de las mujeres que viajaban en cada clase.

In [128]:

women_df = titanic[titanic["Sex"] == "female"] #Se parte en dos la tarea, primero se divide por mujer y luego se agrupa por clase para averiguar la edad

In [127]:
by_class = women_df.groupby('Pclass').agg({'Age': 'mean'}).reset_index()
by_class

   Pclass        Age
0       1  34.611765
1       2  28.722973
2       3  21.750000

10. Añadir una nueva columna booleana para ver si el pasajero era menor de edad o no.

In [132]:
condicion = titanic['Age']<18
titanic['IsMinor'] = condicion
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,IsMinor
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,False
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,False
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,False
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,False
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,False
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,False
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,False
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,False
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,False

11. Mostrar por pantalla el porcentaje de menores y mayores de edad que sobrevivieron en cada clase.

In [155]:
menores_supervivientes = titanic[(titanic['Survived']==1) & (titanic['Age']<18)]
menores_supervivientes

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,IsMinor
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.00,1,0,237736,30.0708,NaN,C,True
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.00,1,1,PP 9549,16.7000,G6,S,True
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.00,0,0,330923,8.0292,NaN,Q,True
39,40,1,3,"Nicola-Yarred, Miss. Jamila",female,14.00,1,0,2651,11.2417,NaN,C,True
43,44,1,2,"Laroche, Miss. Simonne Marie Anne Andree",female,3.00,1,2,SC/Paris 2123,41.5792,NaN,C,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...
830,831,1,3,"Yasbeck, Mrs. Antoni (Selini Alexander)",female,15.00,1,0,2659,14.4542,NaN,C,True
831,832,1,2,"Richards, Master. George Sibley",male,0.83,1,1,29106,18.7500,NaN,S,True
853,854,1,1,"Lines, Miss. Mary Conover",female,16.00,0,1,PC 17592,39.4000,D28,S,True
869,870,1,3,"Johnson, Master. Harold Theodor",male,4.00,1,1,347742,11.1333,NaN,S,True
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.00,0,0,2667,7.2250,NaN,C,True

In [159]:
minors_by_class = pd.pivot_table(data=menores_supervivientes, values='Survived', index=['Pclass'], aggfunc='sum')
minors_by_class

        Survived
Pclass
1             11
2             21
3             29

In [163]:

clase1 = len(titanic[(titanic['Pclass'] == 1) & (titanic['Survived'] == 1) & (titanic['Age'] < 18)])
clase2 = len(titanic[(titanic['Pclass'] == 2) & (titanic['Survived'] == 1) & (titanic['Age'] < 18)])
clase3 = len(titanic[(titanic['Pclass'] == 3) & (titanic['Survived'] == 1) & (titanic['Age'] < 18)])

print(f"Número de pasajeros sobrevivientes menores de 18 años en cada clase:")
print(f"Clase 1: {clase1}")
print(f"Clase 2: {clase2}")
print(f"Clase 3: {clase3}")

Número de pasajeros sobrevivientes menores de 18 años en cada clase:
Clase 1: 11
Clase 2: 21
Clase 3: 29

In [164]:
minors_by_class['Total'] = [clase1, clase2, clase3]
minors_by_class['Porcentaje'] = round((minors_by_class['Survived']/minors_by_class['Total'])*100, 2)
minors_by_class

        Survived  Total  Porcentaje
Pclass
1             11     11       100.0
2             21     21       100.0
3             29     29       100.0

## Ejercicio 8
Los ficheros emisiones-2016.csv, emisiones-2017.csv, emisiones-2018.csv y emisiones-2019.csv, contienen datos sobre las emisiones contaminates en la ciudad de Madrid en los años 2016, 2017, 2018 y 2019 respectivamente. Escribir un programa con los siguientes requisitos:

1. Generar un DataFrame con los datos de los cuatro ficheros.
2. Filtrar las columnas del DataFrame para quedarse con las columnas ESTACION, MAGNITUD, AÑO, MES y las correspondientes a los días D01, D02, etc.
3. Reestructurar el DataFrame para que los valores de los contaminantes de las columnas de los días aparezcan en una única columna.
4. Añadir una columna con la fecha a partir de la concatenación del año, el mes y el día (usar el módulo datetime).
5. Eliminar las filas con fechas no válidas (utilizar la función isnat del módulo numpy) y ordenar el DataFrame por estaciones contaminantes y fecha.
6. Mostrar por pantalla las estaciones y los contaminantes disponibles en el DataFrame.
7. Crear una función que reciba una estación, un contaminante y un rango de fechas y devuelva una serie con las emisiones del contaminante dado en la estación y rango de fechas dado.
8. Mostrar un resumen descriptivo (mínimo, máximo, media, etc.) para cada contaminante.
9. Mostrar un resumen descriptivo para cada contaminante por distritos.
10. Crear una función que reciba una estación y un contaminante y devuelva un resumen descriptivo de las emisiones del contaminante indicado en la estación indicada.
11. Crear una función que devuelva las emisiones medias mensuales de un contaminante y un año dados para todos las estaciones.
12. Crear un función que reciba una estación de medición y devuelva un DataFrame con las medias mensuales de los distintos tipos de contaminantes.